<?php
$i=0;
while ($i<100){
    if (!($i%3)){
        echo $i."<br>";
    }
    $i++;
}

$j=0;
do {
    if ($j==0){
        echo "$j - ноль","<br>";
        $j++;
    } else if (!($j%2)) {
        echo "$j - чётное число","<br>";
        $j++;
    }
    else {
        echo "$j - нечётное число","<br>";
        $j++;
    }     
} while ($j<=10);


$m="Московская область";
$l="Ленинградская область";
$r="Рязанская область";

$array = array ("$m"=>array("Москва", "Зеленоград", "Клин"),
                "$l"=>array("Санкт-Петербург", "Всеволожск", "Павловск", "Кронштадт"),   
                "$r"=>array("Рязань","Скопин","Сасово"));
                
             
foreach ($array as $key=>$arr){
    echo $key,":","<br>";
    echo "|$arr[0]|","$arr[1]|","$arr[2]|","$arr[3]<br>";
}

for ($n = 0; $n < 10; print $n++) {}
?>